    package class_basic;


        //클래스를 구성하는 멤버(요소) - 변수, 메서드의 정의, 생성자
        //클래스 == 자료형

        //변수 : 변수를 선언한 '위치'에 따라 변수의 종류가 달라짐
        //지역변수 : 메서드 안에서 선언된 변수, 반드시 초기화 후에 사용가능
        //매개변수 : 메서드 선언부의 소괄호 안에서 선언된 변수
        //멤버변수(필드, 속성) : 클래스 안에서 선언된 변수, 초기화하지 않으면 기본값으로 자동 초기화 됨


        //Monitor class : 실 생활에 존재 하는 모니터를 코드로 구현하기 위한 설계도(class)
    public class Monitor {//실행은 main 에서만 가능함

        //변수로 표현 - 브랜드, 가격, 색상 -> 속성
        String brand; //null (값을 주지 않으면 기본값인 null이 출력됨 \\ 브랜드 정보를 여기에 저장 == 멤버변수
        int price; // 0
        String color; //null  -- double == 0.0


            // 1. Monitor Class 객체를 생성/*

            // 2. 멤버변수 ex) int price; / 지정해주기
            // 3. 각각의 메서드에 속성을 변경*/


            //1. 만들어 놓은 class에서 객체생성하기
            //(클래스.변수명(내알아서) = new 클래스;)
            //위에서부터 순서대로
            //객체의 변수값 변경
            //지정한변수명.클래스명 = 값
            //출력해보기

            //---------------------

            //커리큘럼 (공부할거)
            //클래스개념, 객체개념, 둘의차이
            //클래스의 구성요소(멤버변수,메서드,생성자)
            //객체생성방법
            //객체에존재하는변수,메서드사용법
            //생성자
            //this 키워드
            //접근제한자
            //클래스는자료형이다


    }
